Revit 2024 API
LinePatternElement.GetLinePattern Method
Overload List
Name | Description
GetLinePattern()
 Gets the LinePattern associated to this element.
GetLinePattern(Document, ElementId)
 Gets the LinePattern associated to an element or from a built-in line pattern.
See Also
LinePatternElement Class
LinePatternElement Members
Autodesk.Revit.DB Namespace